YCSB-master/resultadosAtual/rocksdb-WorkloadA-2000.log
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl com.yahoo.ycsb:rocksdb-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
java -cp /home/jose/Desktop/LEI/Graficos/Key-DocumentDBv1/YCSB-master/rocksdb/conf:/home/jose/Desktop/LEI/Graficos/Key-DocumentDBv1/YCSB-master/rocksdb/target/rocksdb-binding-0.16.0-SNAPSHOT.jar:/home/jose/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/home/jose/.m2/repository/org/slf4j/slf4j-api/1.7.25/slf4j-api-1.7.25.jar:/home/jose/.m2/repository/org/rocksdb/rocksdbjni/5.11.3/rocksdbjni-5.11.3.jar:/home/jose/.m2/repository/net/jcip/jcip-annotations/1.0/jcip-annotations-1.0.jar:/home/jose/Desktop/LEI/Graficos/Key-DocumentDBv1/YCSB-master/core/target/core-0.16.0-SNAPSHOT.jar:/home/jose/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/home/jose/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/home/jose/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -P workloads/workloada -p operationcount=2000 -p rocksdb.dir=./dbR/ycsb-rocksdb-dataV2 -s -t
Command line: -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -P workloads/workloada -p operationcount=2000 -p rocksdb.dir=./dbR/ycsb-rocksdb-dataV2 -s -t
YCSB Client 0.16.0-SNAPSHOT

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
2019-06-22 19:31:32:034 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2019-06-22 19:31:32:386 0 sec: 2000 operations; 5305,04 current ops/sec; [READ: Count=1026, Max=6299, Min=4, Avg=34,36, 90=54, 99=166, 99.9=1818, 99.99=6299] [CLEANUP: Count=1, Max=62399, Min=62368, Avg=62384, 90=62399, 99=62399, 99.9=62399, 99.99=62399] [UPDATE: Count=974, Max=1605, Min=23, Avg=83,24, 90=128, 99=345, 99.9=1310, 99.99=1605] 
[OVERALL], RunTime(ms), 377
[OVERALL], Throughput(ops/sec), 5305.039787798409
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 1026
[READ], AverageLatency(us), 34.364522417154
[READ], MinLatency(us), 4
[READ], MaxLatency(us), 6299
[READ], 95thPercentileLatency(us), 74
[READ], 99thPercentileLatency(us), 166
[READ], Return=OK, 1026
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 62384.0
[CLEANUP], MinLatency(us), 62368
[CLEANUP], MaxLatency(us), 62399
[CLEANUP], 95thPercentileLatency(us), 62399
[CLEANUP], 99thPercentileLatency(us), 62399
[UPDATE], Operations, 974
[UPDATE], AverageLatency(us), 83.24024640657085
[UPDATE], MinLatency(us), 23
[UPDATE], MaxLatency(us), 1605
[UPDATE], 95thPercentileLatency(us), 180
[UPDATE], 99thPercentileLatency(us), 345
[UPDATE], Return=OK, 974
rocksdb-binding
CENAS
['java', '-cp', '/home/jose/Desktop/LEI/Graficos/Key-DocumentDBv1/YCSB-master/rocksdb/conf:/home/jose/Desktop/LEI/Graficos/Key-DocumentDBv1/YCSB-master/rocksdb/target/rocksdb-binding-0.16.0-SNAPSHOT.jar:/home/jose/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/home/jose/.m2/repository/org/slf4j/slf4j-api/1.7.25/slf4j-api-1.7.25.jar:/home/jose/.m2/repository/org/rocksdb/rocksdbjni/5.11.3/rocksdbjni-5.11.3.jar:/home/jose/.m2/repository/net/jcip/jcip-annotations/1.0/jcip-annotations-1.0.jar:/home/jose/Desktop/LEI/Graficos/Key-DocumentDBv1/YCSB-master/core/target/core-0.16.0-SNAPSHOT.jar:/home/jose/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/home/jose/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/home/jose/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar', 'com.yahoo.ycsb.Client', '-db', 'com.yahoo.ycsb.db.rocksdb.RocksDBClient', '-P', 'workloads/workloada', '-p', 'operationcount=2000', '-p', 'rocksdb.dir=./dbR/ycsb-rocksdb-dataV2', '-s']
FIM